function [xx]=pde1(lena,k,r)
% r 设定的r值
% k 迭代次数
% lena 测试的图 在压缩包中有
l=length(lena(:,1));
c1=zeros(5*(l-2)*(l-2),3); %方程条件
c2=zeros((l-2)*2,3); %边界条件1
c3=zeros((l-2)*2,3); %边界条件2
c4=zeros((l-2)*2,3); %边界条件3
c5=zeros((l-2)*2,3); %边界条件4
c6=zeros(4*2,3);     %边界条件5
xx=zeros(5*(l-2)*(l-2)+(l-2)*2+(l-2)*2+(l-2)*2+(l-2)*2+4*2,3);
x2=lena(:);%初值
x3=zeros(l*l,1);%Ax=b的b
p=1;
for i=2:l-1   %方程条件
    for j=2:l-1
        c1(p,1)=i+(j-1)*l;%第几行
        c1(p,2)=i-1+(j-1)*l; %第几列
        c1(p,3)=-r;
        p=p+1;
        c1(p,1)=i+(j-1)*l;%第几行
        c1(p,2)=i+1+(j-1)*l; %第几列
        c1(p,3)=-r;
        p=p+1;
        c1(p,1)=i+(j-1)*l;%第几行
        c1(p,2)=i+(j-1)*l; %第几列
        c1(p,3)=1+4*r;
        p=p+1;
        c1(p,1)=i+(j-1)*l;%第几行
        c1(p,2)=i+(j-2)*l; %第几列
        c1(p,3)=-r;
        p=p+1;
        c1(p,1)=i+(j-1)*l;%第几行
        c1(p,2)=i+j*l; %第几列
        c1(p,3)=-r;
        p=p+1;
        x3(i+(j-1)*l)=lena(i,j);
    end
end
p=1;
for i=2:(l-1)  %边界条件1  左边，(1,i) (2,i)
        c2(p,1)=1+(i-1)*l;%第几行
        c2(p,2)=1+(i-1)*l; %第几列
        c2(p,3)=-r;
        p=p+1;
        c2(p,1)=1+(i-1)*l;%第几行
        c2(p,2)=2+(i-1)*l; %第几列
        c2(p,3)=r;
        p=p+1;
end
p=1;
for i=2:(l-1)  %边界条件2  下面，(i,1)(i,2)
        c3(p,1)=i;%第几行
        c3(p,2)=i; %第几列
        c3(p,3)=-r;
        p=p+1;
        c3(p,1)=i;%第几行
        c3(p,2)=i+l; %第几列
        c3(p,3)=r;
        p=p+1;
end
p=1;
for i=2:(l-1)  %边界条件3  右面，(l,i)(l-1,i)
        c4(p,1)=l+(i-1)*l;%第几行
        c4(p,2)=l+(i-1)*l; %第几列
        c4(p,3)=-r;
        p=p+1;
        c4(p,1)=l+(i-1)*l;%第几行
        c4(p,2)=l-1+(i-1)*l; %第几列
        c4(p,3)=r;
        p=p+1;
end
p=1;
for i=2:(l-1)  %边界条件4  上面，(i，l)(i,l-1)
        c5(p,1)=i+(l-1)*l;%第几行
        c5(p,2)=i+(l-1)*l; %第几列
        c5(p,3)=-r;
        p=p+1;
        c5(p,1)=i+(l-1)*l;%第几行
        c5(p,2)=i+(l-2)*l;%第几列
        c5(p,3)=r;
        p=p+1;
end 
%4个顶角
p=1;%左下(1,1),(2,2)
c6(p,1)=1;%第几行
c6(p,2)=1; %第几列
c6(p,3)=-r;
p=p+1;
c6(p,1)=1;%第几行
c6(p,2)=2+l; %第几列
c6(p,3)=r;

p=p+1;%右下 (l,1)(l-1,2)
c6(p,1)=l;%第几行
c6(p,2)=l;%第几列
c6(p,3)=-r;
p=p+1;
c6(p,1)=l;%第几行
c6(p,2)=l-1+l; %第几列
c6(p,3)=r;

p=p+1;%左上  (1,l)(2,l-1)
c6(p,1)=1+(l-1)*l;%第几行
c6(p,2)=1+(l-1)*l; %第几列
c6(p,3)=-r;
p=p+1;
c6(p,1)=1+(l-1)*l;%第几行
c6(p,2)=2+(l-2)*l; %第几列
c6(p,3)=r;

p=p+1;% 右上(l,l)(l-1,l-1)
c6(p,1)=l+(l-1)*l;%第几行
c6(p,2)=l+(l-1)*l;%第几列
c6(p,3)=-r;
p=p+1;
c6(p,1)=l+(l-1)*l;%第几行
c6(p,2)=l-1+(l-2)*l; %第几列
c6(p,3)=r;

xx(1:5*(l-2)*(l-2),:)=c1;
xx(1+5*(l-2)*(l-2):5*(l-2)*(l-2)+(l-2)*2,:)=c2;
xx(5*(l-2)*(l-2)+(l-2)*2+1:5*(l-2)*(l-2)+(l-2)*2+(l-2)*2,:)=c3;
xx(1+5*(l-2)*(l-2)+(l-2)*2+(l-2)*2:5*(l-2)*(l-2)+(l-2)*2+(l-2)*2+(l-2)*2,:)=c4;
xx(1+5*(l-2)*(l-2)+(l-2)*2+(l-2)*2+(l-2)*2:5*(l-2)*(l-2)+(l-2)*2+(l-2)*2+(l-2)*2+(l-2)*2,:)=c5;
xx(1+5*(l-2)*(l-2)+(l-2)*2+(l-2)*2+(l-2)*2+(l-2)*2:5*(l-2)*(l-2)+(l-2)*2+(l-2)*2+(l-2)*2+(l-2)*2+4*2,:)=c6;


end


        